/*
需求：1、部门列表
*/
Ext.namespace('Js.Center.Statistics.Mt');

/*******************************************************************************
*1、获取发送量统计信息URL(按产品统计)----------------------------------------------
*==========================================================
*url：URL/statistics/mt/statisticcustomsquery.ashx
*==========================================================
*input：
*    flag(countbyproduct),
*    limit，
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：*
*            datemonth（2009-05）*
*        如果是4
*            datcreattimestart,(大于DATCREATTIME)
*            datcreattimeend,(小于DATCREATTIME)
*    numdepartid， (部门编号)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================   
********************************************************************************/


/*******************************************************************************
*3、获取发送量统计信息URL(按栏目统计)------------------------------------------
*==========================================================
*url：URL/statistics/mt/statisticcustomsquery.ashx
*==========================================================
*input：*
*    flag(countbycolumn),
*    limit，*
*    start，*
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：*
*            datemonth（2009-05）*
*        如果是4
*            datcreattimestart,(大于DATCREATTIME)
*            datcreattimeend,(小于DATCREATTIME)
*    numdepartid， (部门编号)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
******************************************************************************
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================
********************************************************************************/

/*******************************************************************************
*7、导出发送量统计信息URL(按栏目统计)
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*    flag(loadbycolumn),
*        limit，
*        start，
*        numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*            如果是3：*
*            datemonth（2009-05）*
*            如果是4
*            datcreattimestart,(大于DATCREATTIME)
*            datcreattimeend,(小于DATCREATTIME)
*        numdepartid， (部门编号)
*        numsmstype， (信息类型 1短信 2长短信 3、WapPush)
******************************************************************************
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================
********************************************************************************/

/*******************************************************************************
*4、获取消费量统计信息URL(按业务)
*==========================================================
*url：URL/statistics/mt/statisticcustomsquery.ashx
*==========================================================
*input：
*    flag(countbybusi),
*    limit，
*    start，
*    datemonth，（2009-05）
*    numdepartid， (部门编号)
*    numoperatorid， (运营商编号)
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================
********************************************************************************/

/*******************************************************************************
*8、导出消费量统计信息URL(按业务)
*==========================================================
*url：URL/statistics/mt/statisticcustomsquery.ashx
*==========================================================
*input：
*    flag(loadbybusi),
*    limit，
*    start，
*    datemonth，（2009-05）
*    numdepartid， (部门编号)
*    numoperatorid， (运营商编号)
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================  
********************************************************************************/

/*******************************************************************************
*5、导出发送量统计信息URL(按产品统计)
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*    flag(loadbyproduct),
*    limit，
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：
*        datemonth（2009-05）
*        如果是4
*        datcreattimestart,(大于DATCREATTIME)
*        datcreattimeend,(小于DATCREATTIME)
*    numdepartid， (部门编号)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================
*method：POST
*==========================================================
*output：多条*========================================================== 
********************************************************************************/

/*******************************************************************************
*2、获取发送量统计信息URL(按部门统计)------------------------------------------
*==========================================================
*url：URL/statistics/mt/statisticcustomsquery.ashx
*==========================================================
*input：
*    flag(countbydepartment),
*    %vc2departname%,(部门,模糊查询)
*    limit，//limit传入0获取所有数据
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：
*            datemonth（2009-05）
*        如果是4
*            datcreattimestart,(大于DATCREATTIME)
*            datcreattimeend,(小于DATCREATTIME)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================    
*method：POST
*==========================================================
*output：多条*==========================================================   
********************************************************************************/

/*******************************************************************************
*6、导出发送量统计信息URL(按部门统计)------------------------------------------
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*    flag(loadbydepartment),
*    %vc2departname%,(部门,模糊查询)
*    limit，
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：*
*        datemonth（2009-05）*
*        如果是4
*        datcreattimestart,(大于DATCREATTIME)
*        datcreattimeend,(小于DATCREATTIME)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================
********************************************************************************/

/*******************************************************************************
*7、导出发送量统计信息URL(按部门统计所有天数的数据)----------------------------------------------------------新增
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*    flag(loadbydepartmentallday),
*    %vc2departname%,(部门,模糊查询)
*    limit，
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：*
*        datemonth（2009-05）*
*        如果是4
*        datcreattimestart,(大于DATCREATTIME)
*        datcreattimeend,(小于DATCREATTIME)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================
*method：POST
*==========================================================
*output：多条*==========================================================
********************************************************************************/

/*******************************************************************************
*新增 发送量按用户统计-
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*	flag(countbycustomer),
*	datcreattimeend,  (大于datcreattimeend)
*    datcreattimestart, (小于datcreattimestart)
*    %vc2departname%,(部门,模糊查询)//修改—原先为部门ID
*    %vc2username%,(用户名,模糊查询)
*    limit,
*    start
*==========================================================
*method：POST
*==========================================================
*output：多条
*==========================================================
********************************************************************************/

/*******************************************************************************
*新增 导出发送量按用户统计
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*	flag(loadbycustomer),
*	datcreattimeend,  (大于datcreattimeend)
*    datcreattimestart, (小于datcreattimestart)
*    %vc2departname%,(部门,模糊查询)//新增
*    %vc2username%,(用户名,模糊查询)
*    limit,
*    start
*==========================================================
*method：POST
*==========================================================
*output：多条
*==========================================================
********************************************************************************/


/*******************************************************************************
*2010-9-15新增 发送量按客户组统计-
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*	flag(countbyusergroup),
*    %vc2departname%,(部门,模糊查询)
*    limit，//limit传入0获取所有数据
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)
*        如果是3：
*            datemonth（2009-05）
*        如果是4
*            datcreattimestart,(大于DATCREATTIME)
*            datcreattimeend,(小于DATCREATTIME)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================
*method：POST
*==========================================================
*output：多条
*==========================================================
********************************************************************************/
/*******************************************************************************
*2010-9-15新增 导出发送量按客户组统计
*==========================================================
*url：URL/statistics/mt/statisticmtquery.ashx
*==========================================================
*input：
*	flag(loadbyusergroup),
*    %vc2departname%,(部门,模糊查询)
*    limit，
*    start，
*    numdatetype,(日期类型 1本月 2本周 3自然月 4自定义)--后台指定默认值
*        如果是3：*
*        datemonth（2009-05）*
*        如果是4
*        datcreattimestart,(大于DATCREATTIME)
*        datcreattimeend,(小于DATCREATTIME)
*    numsmstype， (信息类型 1短信 2长短信 3、WapPush)
*==========================================================
*method：POST
*==========================================================
*output：多条
*==========================================================
********************************************************************************/

Js.Center.Statistics.StatisticsMtURL  = 'URL/statistics/mt/statisticmtquery.ashx';

