Ext.namespace('Js.Center.System');

/*******************************************************************************
*获取通道组监控数据
*==========================================================
*url：URL/system/productmonitor/productmonitorquerry.ashx
*==========================================================
*input：
*	flag(selectmonitorbyproduct),
*    limit,
*    start
*==========================================================
*method：POST
*==========================================================
*output：多条
*==========================================================
********************************************************************************/

Js.Center.System.ProductMonitorURL = 'URL/system/productmonitor/productmonitorquery.ashx';